kdicox/STM32H750IBK6/01_STM32H750IBK6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DEVICE_ID3_Pin GPIO_PIN_3
#define DEVICE_ID3_GPIO_Port GPIOE
#define DEVICE_ID2_Pin GPIO_PIN_2
#define DEVICE_ID2_GPIO_Port GPIOE
#define DEVICE_ID1_Pin GPIO_PIN_1
#define DEVICE_ID1_GPIO_Port GPIOE
#define DEVICE_ID0_Pin GPIO_PIN_0
#define DEVICE_ID0_GPIO_Port GPIOE
#define DEVICE_ID4_Pin GPIO_PIN_4
#define DEVICE_ID4_GPIO_Port GPIOE
#define DEVICE_ID5_Pin GPIO_PIN_5
#define DEVICE_ID5_GPIO_Port GPIOE
#define DEVICE_ID6_Pin GPIO_PIN_6
#define DEVICE_ID6_GPIO_Port GPIOE
#define LED1_Pin GPIO_PIN_0
#define LED1_GPIO_Port GPIOC
#define LED2_Pin GPIO_PIN_1
#define LED2_GPIO_Port GPIOC
#define LED3_Pin GPIO_PIN_2
#define LED3_GPIO_Port GPIOC
#define DEVICE_ID8_Pin GPIO_PIN_8
#define DEVICE_ID8_GPIO_Port GPIOE
#define DEVICE_ID9_Pin GPIO_PIN_9
#define DEVICE_ID9_GPIO_Port GPIOE
#define DEVICE_ID7_Pin GPIO_PIN_7
#define DEVICE_ID7_GPIO_Port GPIOE
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
